#### Terraform Plan 📝`success`

<details><summary>Show Plan</summary>

```terraform
aws_elastic_beanstalk_application.task_listing_app: Refreshing state... [id=patsy-task-listing-app]
aws_ecr_repository.task_listing_app: Refreshing state... [id=task-listing-app]
aws_iam_role.elastic_beanstalk_ec2_role: Refreshing state... [id=elastic-beanstalk-ec2-role]
aws_iam_role_policy_attachment.eb_worker_tier: Refreshing state... [id=elastic-beanstalk-ec2-role-20250409103819313700000002]
aws_iam_role_policy_attachment.eb_web_tier: Refreshing state... [id=elastic-beanstalk-ec2-role-20250409103819124100000001]
aws_iam_instance_profile.elastic_beanstalk_ec2_instance_profile: Refreshing state... [id=elastic-beanstalk-ec2-instance-profile]
aws_iam_role_policy_attachment.eb_ecr_access: Refreshing state... [id=elastic-beanstalk-ec2-role-20250409105139402900000001]
aws_elastic_beanstalk_environment.task_listing_app_environment: Refreshing state... [id=e-kdvrswf3pu]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_elastic_beanstalk_environment.task_listing_app_environment will be updated in-place
  ~ resource "aws_elastic_beanstalk_environment" "task_listing_app_environment" {
        id                     = "e-kdvrswf3pu"
        name                   = "patsy-task-listing-app-env"
        tags                   = {}
        # (19 unchanged attributes hidden)

      - setting {
          - name      = "Application Healthcheck URL" -> null
          - namespace = "aws:elasticbeanstalk:application" -> null
          - value     = "/" -> null
            # (1 unchanged attribute hidden)
        }
      - setting {
          - name      = "DeploymentPolicy" -> null
          - namespace = "aws:elasticbeanstalk:command" -> null
          - value     = "AllAtOnce" -> null
            # (1 unchanged attribute hidden)
        }
      - setting {
          - name      = "EC2KeyName" -> null
          - namespace = "aws:autoscaling:launchconfiguration" -> null
          - value     = "patsy-new-key-ec2-task" -> null
            # (1 unchanged attribute hidden)
        }
      - setting {
          - name      = "EnvironmentType" -> null
          - namespace = "aws:elasticbeanstalk:environment" -> null
          - value     = "SingleInstance" -> null
            # (1 unchanged attribute hidden)
        }
      - setting {
          - name      = "IamInstanceProfile" -> null
          - namespace = "aws:autoscaling:launchconfiguration" -> null
          - value     = "elastic-beanstalk-ec2-instance-profile" -> null
            # (1 unchanged attribute hidden)
        }
      - setting {
          - name      = "InstanceType" -> null
          - namespace = "aws:autoscaling:launchconfiguration" -> null
          - value     = "t2.micro" -> null
            # (1 unchanged attribute hidden)
        }
      + setting {
          + name      = "Application Healthcheck URL"
          + namespace = "aws:elasticbeanstalk:application"
          + value     = "/"
        }
      + setting {
          + name      = "DeploymentPolicy"
          + namespace = "aws:elasticbeanstalk:command"
          + value     = "AllAtOnce"
        }
      + setting {
          + name      = "EC2KeyName"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "patsy-new-key-ec2-task"
        }
      + setting {
          + name      = "EnvironmentType"
          + namespace = "aws:elasticbeanstalk:environment"
          + value     = "SingleInstance"
        }
      + setting {
          + name      = "IamInstanceProfile"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "patsy-elastic-beanstalk-ec2-instance-profile"
            # (1 unchanged attribute hidden)
        }
      + setting {
          + name      = "InstanceType"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "t2.micro"
        }
    }

  # aws_iam_instance_profile.elastic_beanstalk_ec2_instance_profile must be replaced
-/+ resource "aws_iam_instance_profile" "elastic_beanstalk_ec2_instance_profile" {
      ~ arn         = "arn:aws:iam::664047078509:instance-profile/elastic-beanstalk-ec2-instance-profile" -> (known after apply)
      ~ create_date = "2025-04-09T10:38:19Z" -> (known after apply)
      ~ id          = "elastic-beanstalk-ec2-instance-profile" -> (known after apply)
      ~ name        = "elastic-beanstalk-ec2-instance-profile" -> "patsy-elastic-beanstalk-ec2-instance-profile" # forces replacement
      + name_prefix = (known after apply)
      ~ role        = "elastic-beanstalk-ec2-role" -> "patsy-elastic-beanstalk-ec2-role"
      - tags        = {} -> null
      ~ tags_all    = {} -> (known after apply)
      ~ unique_id   = "AIPAZVHCKJRWWP2DM22TO" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role.elastic_beanstalk_ec2_role must be replaced
-/+ resource "aws_iam_role" "elastic_beanstalk_ec2_role" {
      ~ arn                   = "arn:aws:iam::664047078509:role/elastic-beanstalk-ec2-role" -> (known after apply)
      ~ create_date           = "2025-04-09T10:38:18Z" -> (known after apply)
      ~ id                    = "elastic-beanstalk-ec2-role" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AWSElasticBeanstalkWebTier",
          - "arn:aws:iam::aws:policy/AWSElasticBeanstalkWorkerTier",
          - "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryFullAccess",
        ] -> (known after apply)
      ~ name                  = "elastic-beanstalk-ec2-role" -> "patsy-elastic-beanstalk-ec2-role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROAZVHCKJRWS3HF6KZAA" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.eb_ecr_access must be replaced
-/+ resource "aws_iam_role_policy_attachment" "eb_ecr_access" {
      ~ id         = "elastic-beanstalk-ec2-role-20250409105139402900000001" -> (known after apply)
      ~ role       = "elastic-beanstalk-ec2-role" -> "patsy-elastic-beanstalk-ec2-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.eb_web_tier must be replaced
-/+ resource "aws_iam_role_policy_attachment" "eb_web_tier" {
      ~ id         = "elastic-beanstalk-ec2-role-20250409103819124100000001" -> (known after apply)
      ~ role       = "elastic-beanstalk-ec2-role" -> "patsy-elastic-beanstalk-ec2-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.eb_worker_tier must be replaced
-/+ resource "aws_iam_role_policy_attachment" "eb_worker_tier" {
      ~ id         = "elastic-beanstalk-ec2-role-20250409103819313700000002" -> (known after apply)
      ~ role       = "elastic-beanstalk-ec2-role" -> "patsy-elastic-beanstalk-ec2-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 5 to add, 1 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>